app/views/user_leaves/index.html.erb

        <td><%= user_leave.user_id %></td>
        <td> <% @user=User.find(user_leave.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 11]]