app/views/user_leaves/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 11]]
---
  <strong>User_Name:</strong>
  <% @user=User.find(@user_leave.user_id) %>