app/views/leaves/apply_index.html.erb

      <tr>
         <% @u = User.find(leave.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 11]]