app/controllers/leaves_controller.rb

SELECT "leaves".* FROM "leaves"
---
  def index
    @leaves = Leave.all

SELECT "leaves".* FROM "leaves" WHERE "leaves"."status" = ?  [["status", "f"]]
---
  def apply_index
    @leaves =Leave.where(:status => false)

SELECT  "leaves".* FROM "leaves" WHERE "leaves"."id" = ? LIMIT 1  [["id", 19]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 11]]
SELECT "user_leaves".* FROM "user_leaves" WHERE "user_leaves"."user_id" = ? AND "user_leaves"."leave_type" = ?  [["user_id", 11], ["leave_type", "CL"]]
UPDATE "user_leaves" SET "leave_taken" = ?, "leave_left" = ?, "updated_at" = ? WHERE "user_leaves"."id" = ?  [["leave_taken", 2], ["leave_left", 4], ["updated_at", "2017-07-05 08:02:53.596918"], ["id", 46]]
---
  def approve_leave

    @leave = Leave.find(params[:id])
    @leave.status = true
    @u = User.find(@leave.user_id)
        @ul = UserLeave.where(:user_id => @u.id, :leave_type => @leave.leave_type)
        @ul1 = @ul[0]
        @ul1.leave_taken = @ul1.leave_taken + @leave.duration
        @ul1.leave_left = @ul1.leave_left - @leave.duration
        @ul1.save

INSERT INTO "leaves" ("leave_type", "from_date", "to_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["leave_type", "SL"], ["from_date", "2017-07-07"], ["to_date", "2017-07-09"], ["user_id", 11], ["created_at", "2017-07-07 05:12:08.019254"], ["updated_at", "2017-07-07 05:12:08.019254"]]
UPDATE "leaves" SET "duration" = ?, "updated_at" = ? WHERE "leaves"."id" = ?  [["duration", 2], ["updated_at", "2017-07-07 05:12:08.042253"], ["id", 25]]
---
  def create
    #@leave = Leave.new(leave_params)


    @leave = current_user.leaves.create(leave_params)

    respond_to do |format|
      @leave.duration=(@leave.to_date - @leave.from_date).to_i

      if @leave.save

DELETE FROM "leaves" WHERE "leaves"."id" = ?  [["id", 2]]
---
  def destroy
    @leave.destroy

SELECT  "leaves".* FROM "leaves" WHERE "leaves"."id" = ? LIMIT 1  [["id", 10]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 11]]
---
    def set_leave
      @leave = Leave.find(params[:id])
      @u = User.find(current_user.id)