app/controllers/static_pages_controller.rb

SELECT "users".* FROM "users"
---
    def show
    	#@users = User.paginate(:page => params[:page], per_page: 10)
    	@users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 11]]
UPDATE "users" SET "banned" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["banned", "t"], ["updated_at", "2017-06-20 07:56:19.698112"], ["id", 2]]
---
def block
    @u = User.find(params[:id])
    #puts (@u.id)
    @u.banned = true
    @u.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 11]]
UPDATE "users" SET "banned" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["banned", "f"], ["updated_at", "2017-07-03 06:49:34.636292"], ["id", 14]]
---
 def unblock
    @u = User.find(params[:id])
    #puts (@u.id)
    @u.banned = false
    @u.save