app/controllers/user_leaves_controller.rb

  def index
    @user_leaves = UserLeave.all
---
SELECT "user_leaves".* FROM "user_leaves"

  def create
    @user_leave = UserLeave.new(user_leave_params)

    respond_to do |format|
      if @user_leave.save
---
INSERT INTO "user_leaves" ("user_id", "leave_type", "leave_taken", "leave_left", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["leave_type", "CL"], ["leave_taken", 2], ["leave_left", 4], ["created_at", "2017-07-07 05:43:06.440640"], ["updated_at", "2017-07-07 05:43:06.440640"]]

  def destroy
    @user_leave.destroy
---
DELETE FROM "user_leaves" WHERE "user_leaves"."id" = ?  [["id", 101]]

    def set_user_leave
      @user_leave = UserLeave.find(params[:id])
---
SELECT  "user_leaves".* FROM "user_leaves" WHERE "user_leaves"."id" = ? LIMIT 1  [["id", 101]]