app/controllers/users_controller.rb

def destroy
	@u =User.find(params[:id])
	@u.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]

   def update
     @user = User.find(params[:id])
     if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 11]]
UPDATE "users" SET "name" = ?, "date_of_birth" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "mithal"], ["date_of_birth", "2017-06-20 00:00:00.000000"], ["updated_at", "2017-06-20 05:37:51.932292"], ["id", 4]]